# import random
# a = random.randint(1,100)
# i=0
# while True:
#     b=int(input('(1~100)숫자를 맞춰보세요'))
#     i +=1  
#     if a > b:
#         print('UP 입니다.')
#     elif a<b:
#         print('Down입니다.')
#     elif a==b :
#         print(f'정답입니다.\n총시도횟수: {i}')
#         break
#     else : print('다시입력하세요')

# 1에서부터 6까지의 눈을 가진 3개의 주사위를 던져서 다음과 같은 규칙에 따라 상금을 받는 게임이 있다. 

# 같은 눈이 3개가 나오면 10,000원+(같은 눈)×1,000원의 상금을 받게 된다. 
# 같은 눈이 2개만 나오는 경우에는 1,000원+(같은 눈)×100원의 상금을 받게 된다. 
# 모두 다른 눈이 나오는 경우에는 (그 중 가장 큰 눈)×100원의 상금을 받게 된다.  
# 예를 들어, 3개의 눈 3, 3, 6이 주어지면 상금은 1,000+3×100으로 계산되어 1,300원을 받게 된다. 
# 또 3개의 눈이 2, 2, 2로 주어지면 10,000+2×1,000 으로 계산되어 12,000원을 받게 된다. 3개의 눈이 6, 2, 5로 주어지면 그중 가장 큰 값이 6이므로 6×100으로 계산되어 600원을 상금으로 받게 된다.

# import random
# a ,b,c = map(int,input().split())
# if a == b and b == c :    p = 10000+a*1000
# elif a == b or a ==c :    p = 1000+a*100
# else:    
#     if a > b and a > c:
#         p=a*100
#     elif a > b and a<c :
#         p=c*100
#     else:
#         p=b*100
# print(p)


